Revit 2020 API
Dimension Properties
The Dimension type exposes the following members.
Properties
Name | Description
Above
The text shown above the segment's value.
AreReferencesAvailable
 Indicates if this dimension's references can be resolved.
AreSegmentsEqual
Indicates if all segments are forced to be equal.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
Below
The text shown below the segment's value.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
Curve
 A curve that represents the dimension line.
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
DimensionShape
The shape of this dimension.
DimensionType
 The dimension style of this dimension.
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
FamilyLabel
The family parameter label of the dimension.
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsLocked
 Indicates if this dimension is locked.
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValid
 Indicates if this dimension is valid.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LeaderEndPosition
 The position of the dimension's leader end point.
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
Retrieves or changes the name associated with the Dimension.
NumberOfSegments
The number of segments for the dimension.
Origin
 The dimension origin.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Prefix
The text shown before the segment's value.
References
 Returns an array of geometric references to which the dimension is attached.
Segments
The segments in the dimension.
Suffix
The text shown after the segment's value.
TextPosition
 The position of the dimension text's drag point.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
Value
 The value of the dimension.
ValueOverride
The text that replaces the segment's value.
ValueString
 The dimension value as a user visible string.
View
 Supplies the view that contains the dimension if the dimension is view specific.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
Dimension Class
Autodesk.Revit.DB Namespace